theMachineMasse/MicrowaveFilterTuner/STM32/MotorControlSubSystem.c
/********************************************
*	Project: Microwave Filter Tuner
* File: MotorControlSubSystem
*	Date: January 27, 2020
*	Programmer(s): Matthew Rostad
* Sub-System: Motor Control Sub-System
*	Description: Contains the movement of the motors from Gcode commands
* Version: 1.0
*	
********************************************/

/* INCLUDES */
#include "MotorControlSubSystem.h"
#include "Communications.h"
#include "stm32f10x.h"
#include "VisualDisplaySubSystem.h"

//Globals
int xPosG = 0;
int yPosG = 0;
int zPosG = 0;
const int stepsPerMM = 100;
const int rampSize = 1900;
const int maxSpeed = 4000;
const int minSpeed = 200;
const int slowRampSize = 190;
const int slowMaxSpeed = 400;
const int slowMinSpeed = 40;

int pDegG = 0;
//bool encFlag = false;
int encFlag = 0;
const int stepsPerDeg = 9;
const int rampSizeDeg = 1900;
const int maxSpeedDeg = 4000;
const int minSpeedDeg = 200;
const int slowRampSizeDeg = 190;
const int slowMaxSpeedDeg = 400;
const int slowMinSpeedDeg = 40;


/*******************************************
*	Function: motorInit
*	Date: February 20, 2020
*	Purpose: Initializes necessary motor GPIO pins
*	Parameters: N/A
*	Return value: N/A
*******************************************/
void motorInit(void){	
	
	
	//remap pins
	RCC->APB2ENR |= RCC_APB2ENR_AFIOEN;
	AFIO->MAPR |= AFIO_MAPR_SWJ_CFG_JTAGDISABLE;
	
	//motor GPIO init
	GPIOA->CRL |= GPIO_CRL_MODE7 ;
	GPIOA->CRL &= ~GPIO_CRL_CNF7 ;
	GPIOA->CRH |= GPIO_CRH_MODE8 | GPIO_CRH_MODE9 | GPIO_CRH_MODE10 | GPIO_CRH_MODE11 | GPIO_CRH_MODE12 | GPIO_CRH_MODE15;
	GPIOA->CRH &= ~GPIO_CRH_CNF8 & ~GPIO_CRH_CNF9 & ~GPIO_CRH_CNF10 & ~GPIO_CRH_CNF11 & ~GPIO_CRH_CNF12 & ~GPIO_CRH_CNF15;
	
	GPIOB->CRL |= GPIO_CRL_MODE6 | GPIO_CRL_MODE7;
	GPIOB->CRL &= ~GPIO_CRL_CNF6 & ~GPIO_CRL_CNF7;
	GPIOB->CRH |= GPIO_CRH_MODE8;
	GPIOB->CRH &= ~GPIO_CRH_CNF8;
	
	
	//disable steppers by defualt
	GPIOA->BSRR |= GPIO_BSRR_BS7;				//use this one 
	GPIOA->BSRR |= GPIO_BSRR_BS8;
	GPIOA->BSRR |= GPIO_BSRR_BS9;
	GPIOA->BSRR |= GPIO_BSRR_BS10;
	GPIOA->BSRR |= GPIO_BSRR_BS11;
	GPIOA->BSRR |= GPIO_BSRR_BS12;
	GPIOA->BSRR |= GPIO_BSRR_BS15;
	GPIOB->BSRR |= GPIO_BSRR_BS6;
	GPIOB->BSRR |= GPIO_BSRR_BS7;
	GPIOB->BSRR |= GPIO_BSRR_BS8;
	
}


/*******************************************
*	Function: moveX
*	Date: February 20, 2020
*	Purpose: Moves the X axis the desired amount
*	Parameters: int movePosition
*	Return value: N/A
*******************************************/
void moveX(int movePosition){
	sendbyte(' ');
	sendbyte('X');
	printHex(movePosition);
	sendbyte(' ');
	lcd_Display_Status(5);
	int moveAmount = movePosition - xPosG;			//amount to move based off desired position minus current position 
	xPosG = movePosition;												//update the current position
	
	moveMotor(1,moveAmount);
	
}

/*******************************************
*	Function: moveY
*	Date: February 20, 2020
*	Purpose: Moves the Y axis the desired amount
*	Parameters: int movePosition
*	Return value: N/A
*******************************************/
void moveY(int movePosition){
	sendbyte(' ');
	sendbyte('Y');
	printHex(movePosition);
	sendbyte(' ');
	lcd_Display_Status(6);
	int moveAmount = movePosition - yPosG;			//amount to move based off desired position minus current position 
	yPosG = movePosition;												//update the current position
	
	moveMotor(2,moveAmount);
}

/*******************************************
*	Function: moveZ
*	Date: February 20, 2020
*	Purpose: Moves the Z axis the desired amount
*	Parameters: int movePosition
*	Return value: N/A
*******************************************/
void moveZ(int movePosition){
	sendbyte(' ');
	sendbyte('Z');
	printHex(movePosition);
	sendbyte(' ');
	lcd_Display_Status(7);
	int moveAmount = movePosition - zPosG;			//amount to move based off desired position minus current position 
	zPosG = movePosition;												//update the current position
	
	moveMotor(3,moveAmount);
}

/*******************************************
*	Function: moveXSlow
*	Date: February 20, 2020
*	Purpose: Moves the X axis the desired amount at a slower speed
*	Parameters: int movePosition
*	Return value: N/A
*******************************************/
void moveXSlow(int movePosition){
	sendbyte(' ');
	sendbyte('X');
	sendbyte('S');
	printHex(movePosition);
	sendbyte(' ');
	lcd_Display_Status(5);
	int moveAmount = movePosition - xPosG;			//amount to move based off desired position minus current position 
	xPosG = movePosition;												//update the current position
	
	moveMotorSlow(1,moveAmount);
}

/*******************************************
*	Function: moveYSlow
*	Date: February 20, 2020
*	Purpose: Moves the Y axis the desired amount at a slower speed
*	Parameters: int movePosition
*	Return value: N/A
*******************************************/
void moveYSlow(int movePosition){
	sendbyte(' ');
	sendbyte('Y');
	sendbyte('S');
	printHex(movePosition);
	sendbyte(' ');
	lcd_Display_Status(6);
	int moveAmount = movePosition - yPosG;			//amount to move based off desired position minus current position 
	yPosG = movePosition;												//update the current position
	
	moveMotorSlow(2,moveAmount);
}

/*******************************************
*	Function: moveZSlow
*	Date: February 20, 2020
*	Purpose: Moves the Z axis the desired amount at a slower speed
*	Parameters: int movePosition
*	Return value: N/A
*******************************************/
void moveZSlow(int movePosition){
	sendbyte(' ');
	sendbyte('Z');
	sendbyte('S');
	printHex(movePosition);
	sendbyte(' ');
	lcd_Display_Status(7);
	int moveAmount = movePosition - zPosG;			//amount to move based off desired position minus current position 
	zPosG = movePosition;												//update the current position
	
	moveMotorSlow(3,moveAmount);
}


/*******************************************
*	Function: moveP
*	Date: February 25, 2020
*	Purpose: Rotates the Phi axis the desired amount in degrees
*	Parameters: int movePosition
*	Return value: N/A
*******************************************/
void moveP(int movePosition){
	sendbyte(' ');
	sendbyte('P');
	printHex(movePosition);
	sendbyte(' '); 
	pDegG = movePosition;												//update the current position
	
	moveMotorDeg(movePosition);
	
