theMachineMasse/MicrowaveFilterTuner/STM32/MotorControlSubSystem.c
		delayTime = (1000000/slowMaxSpeed)/2;
		for(int i = 0; i < 100; i++){
			if     (axis == 1) GPIOA->BSRR |= GPIO_BSRR_BS15;
			else if(axis == 2) GPIOB->BSRR |= GPIO_BSRR_BS8;
			else if(axis == 3) GPIOA->BSRR |= GPIO_BSRR_BS11;
			delayUs(delayTime);
			if     (axis == 1) GPIOA->BSRR |= GPIO_BSRR_BS15;
			else if(axis == 2) GPIOB->BSRR |= GPIO_BSRR_BS8;
			else if(axis == 3) GPIOA->BSRR |= GPIO_BSRR_BS11;
			delayUs(delayTime);
		}
}
}

/*******************************************
*	Function: moveMotorDeg
*	Date: February 20, 2020
*	Purpose: Moves the motor the desired amount in degrees
*	Parameters: int axis, int movePosition
*	Return value: N/A
*******************************************/
void moveMotorDeg(int moveAmount){
	sendbyte('v');
	moveAmount = (moveAmount * stepsPerDeg) / 10;				//convert move amount from degrees to steps
	
	if(moveAmount > 0){																	//if move direction is positive set direction outputs high
		GPIOA->BSRR |= GPIO_BSRR_BS8;
	}
	else{																								//if move direction is negative set direction outputs low
		GPIOA->BSRR |= GPIO_BSRR_BR8;
		moveAmount = moveAmount * -1;											//if move direction is negative take the absolute value
	}
	printHex(moveAmount);
	sendbyte(' ');
	sendbyte(' ');
	
	
	if(moveAmount >= rampSizeDeg*2){												//if long move distance use accel, coast, devel ramp
		int speedAccel;
		int delayTime;
		
		//accel
		int accelRate = (maxSpeedDeg - minSpeedDeg) / rampSizeDeg;
		for(int i = 0; i < rampSizeDeg; i++){
			speedAccel = minSpeedDeg + accelRate*(i);
			delayTime = (1000000/speedAccel)/2;
			
			GPIOA->BSRR |= GPIO_BSRR_BS9;
			delayUs(delayTime);
			GPIOA->BSRR |= GPIO_BSRR_BR9;
			delayUs(delayTime);
		}
		
		//coast
		int coastSteps = moveAmount - rampSizeDeg*2;
		delayTime = (1000000/maxSpeedDeg)/2;
		for(int i = 0; i < coastSteps; i++){
			GPIOA->BSRR |= GPIO_BSRR_BS9;
			delayUs(delayTime);
			GPIOA->BSRR |= GPIO_BSRR_BR9;
			delayUs(delayTime);
			
		}
		
		//decel
		for(int i = 0; i < rampSizeDeg; i++){
			speedAccel = maxSpeedDeg -  accelRate*(i);
			delayTime = (1000000/speedAccel)/2;
			
			GPIOA->BSRR |= GPIO_BSRR_BS9;
			delayUs(delayTime);
			GPIOA->BSRR |= GPIO_BSRR_BR9;
			delayUs(delayTime);
		}
	}
	
	else{																									//if short move use accel, decel ramp
		int speedAccel;
		int delayTime;
		int maxSpeedReached;
		
		//accel
		int accelRate = (maxSpeedDeg - minSpeedDeg) / rampSizeDeg;
		for(int i = 0; i < moveAmount/2; i++){
			speedAccel = minSpeedDeg + accelRate*(i);
			maxSpeedReached = speedAccel;
			delayTime = (1000000/speedAccel)/2;
			
			GPIOA->BSRR |= GPIO_BSRR_BS9;
			delayUs(delayTime);
			GPIOA->BSRR |= GPIO_BSRR_BR9;
			delayUs(delayTime);
		}
		
		
		//decel
		for(int i = 0; i < moveAmount/2; i++){
			speedAccel = maxSpeedReached -  accelRate*(i);
			delayTime = (1000000/speedAccel)/2;
			
			GPIOA->BSRR |= GPIO_BSRR_BS9;
			delayUs(delayTime);
			GPIOA->BSRR |= GPIO_BSRR_BR9;
			delayUs(delayTime);
		}
	}
}

/*******************************************
*	Function: phiHome
*	Date: February 29, 2020
*	Purpose: Moves the motor the desired amount in degrees
*	Parameters: int axis, int movePosition
*	Return value: N/A
*******************************************/
void phiHome(){
	
	int moveAmount = 360; 															//move one full rotation
	int timeoutValue = 324;															//(moveAmount * stepsPerDeg) / 10
	int timeoutCount = 0;																//timeout counter
		
	
	moveAmount = (moveAmount * stepsPerDeg) / 10;				//convert move amount from degrees to steps
	
	if(moveAmount > 0){																	//if move direction is positive set direction outputs high
		GPIOA->BSRR |= GPIO_BSRR_BS8;
	}
	else{																								//if move direction is negative set direction outputs low
		GPIOA->BSRR |= GPIO_BSRR_BR8;
		moveAmount = moveAmount * -1;											//if move direction is negative take the absolute value
	}
	
	printHex(moveAmount);
	sendbyte(' ');
	sendbyte(' ');
	
	lcd_Display_Status(4);															//status: homing phi
	
	if(moveAmount >= rampSizeDeg*2){										//if long move distance use accel, coast, devel ramp
		int speedAccel;
		int delayTime;
		
		//accel
		int accelRate = (maxSpeedDeg - minSpeedDeg) / rampSizeDeg;
		for(int i = 0; i < rampSizeDeg; i++){
			speedAccel = minSpeedDeg + accelRate*(i);
			delayTime = (1000000/speedAccel)/2;
			
			if ((GPIOB->IDR & GPIO_IDR_IDR9) == 0){
			
				GPIOA->BSRR |= GPIO_BSRR_BS9;
				
				timeoutCount++;
	
				if(timeoutCount >= timeoutValue){
					lcd_Display_Error(13);
				}
								
				delayUs(delayTime);
				
				if ((GPIOB->IDR & GPIO_IDR_IDR9) == 0){
					
					GPIOA->BSRR |= GPIO_BSRR_BR9;
					
					timeoutCount++;
	
					if(timeoutCount >= timeoutValue){
						lcd_Display_Error(13);
					}
					
					delayUs(delayTime);
				}
				else{
					i = rampSizeDeg;
				}
			}
			else{
				i = rampSizeDeg;
			}
		}
		
		//coast
		int coastSteps = moveAmount - rampSizeDeg*2;
		delayTime = (1000000/maxSpeedDeg)/2;
		for(int i = 0; i < coastSteps; i++){
			
			if ((GPIOB->IDR & GPIO_IDR_IDR9) == 0){
				
				GPIOA->BSRR |= GPIO_BSRR_BS9;
				
				timeoutCount++;
	
				if(timeoutCount >= timeoutValue){
					lcd_Display_Error(13);
				}
					
				delayUs(delayTime);
				
				if ((GPIOB->IDR & GPIO_IDR_IDR9) == 0){
					
					GPIOA->BSRR |= GPIO_BSRR_BR9;
					
					timeoutCount++;
	
					if(timeoutCount >= timeoutValue){
						lcd_Display_Error(13);
					}
					
					delayUs(delayTime);
				}
				else{
					i = coastSteps;
				}
			}
			else{
				i = coastSteps;
			}
		}
		
		//decel
		for(int i = 0; i < rampSizeDeg; i++){
			speedAccel = maxSpeedDeg -  accelRate*(i);
			delayTime = (1000000/speedAccel)/2;
			
			if ((GPIOB->IDR & GPIO_IDR_IDR9) == 0){
				
				GPIOA->BSRR |= GPIO_BSRR_BS9;
				
				timeoutCount++;
	
				if(timeoutCount >= timeoutValue){
					lcd_Display_Error(13);
				}
					
				delayUs(delayTime);
				
				if ((GPIOB->IDR & GPIO_IDR_IDR9) == 0){
				
					GPIOA->BSRR |= GPIO_BSRR_BR9;
					
					timeoutCount++;
	
					if(timeoutCount >= timeoutValue){
						lcd_Display_Error(13);
					}
					
