theMachineMasse/MicrowaveFilterTuner/STM32/MotorControlSubSystem.c
					delayUs(delayTime);
				}
				else{
					i = rampSizeDeg;
				}
			}
			else{
				i = rampSizeDeg;
			}
		}
	}
	
	else{																									//if short move use accel, decel ramp
		int speedAccel;
		int delayTime;
		int maxSpeedReached;
		
		//accel
		int accelRate = (maxSpeedDeg - minSpeedDeg) / rampSizeDeg;
		for(int i = 0; i < moveAmount/2; i++){
			speedAccel = minSpeedDeg + accelRate*(i);
			maxSpeedReached = speedAccel;
			delayTime = (1000000/speedAccel)/2;
			
			if ((GPIOB->IDR & GPIO_IDR_IDR9) == 0){
				
				GPIOA->BSRR |= GPIO_BSRR_BS9;
				
				timeoutCount++;
	
				if(timeoutCount >= timeoutValue){
					lcd_Display_Error(13);
				}
					
				delayUs(delayTime);
				
				if ((GPIOB->IDR & GPIO_IDR_IDR9) == 0){
					
					GPIOA->BSRR |= GPIO_BSRR_BR9;
					timeoutCount++;
	
					if(timeoutCount >= timeoutValue){
						lcd_Display_Error(13);
					}
					
					delayUs(delayTime);
				}
				else{
					i = moveAmount/2;
				}
			}
			else{
			i = moveAmount/2;
			}			
		}
		
		//decel
		for(int i = 0; i < moveAmount/2; i++){
			speedAccel = maxSpeedReached -  accelRate*(i);
			delayTime = (1000000/speedAccel)/2;
			
			if ((GPIOB->IDR & GPIO_IDR_IDR9) == 0){
				
				GPIOA->BSRR |= GPIO_BSRR_BS9;
				
				timeoutCount++;
	
				if(timeoutCount >= timeoutValue){
					lcd_Display_Error(13);
				}
					
				delayUs(delayTime);
				
				if ((GPIOB->IDR & GPIO_IDR_IDR9) == 0){
					
					GPIOA->BSRR |= GPIO_BSRR_BR9;
					
					timeoutCount++;
	
					if(timeoutCount >= timeoutValue){
						lcd_Display_Error(13);
					}
					
					delayUs(delayTime);
				}
				else{
					i = moveAmount/2;
				}
			}
			else{
				i = moveAmount/2;
			}			
		}
	}
	
	lcd_Display_Status(2);																//status: ready
	
}


/*******************************************
*	Function: nonRecoverableError
*	Date: March 1, 2020
*	Purpose: Inifinite loop for when a non recoverable error occurs
*	Parameters: N/A
*	Return value: N/A
*******************************************/
void nonRecoverableError(){
	while(1);
}





